[
    {
        "_id": "507f1f77bcf86cd799439081",
        "tournamentId": "507f1f77bcf86cd799439011",
        "title": "League of Legends Championship 2025: Team Flash giành chiến thắng ấn tượng",
        "content": "Trong trận đấu khai mạc giải League of Legends Championship 2025, Team Flash đã thể hiện sức mạnh vượt trội khi đánh bại Saigon Phantom với tỷ số 3-1. Các thành viên của Team Flash đã thể hiện kỹ năng điêu luyện và sự phối hợp hoàn hảo trong suốt trận đấu. Đặc biệt, người chơi Lê Văn Player đã có những pha gank xuất sắc giúp đội nhà giành được lợi thế từ những phút đầu tiên.",
        "images": [
            "https://images.unsplash.com/photo-1542751371-adc38448a05e?w=800&h=400&fit=crop",
            "https://images.unsplash.com/photo-1542751371-adc38448a05e?w=800&h=400&fit=crop"
        ],
        "authorId": "507f1f77bcf86cd799439021",
        "publishedAt": "2025-01-15T10:00:00Z",
        "status": "public"
    },
    {
        "_id": "507f1f77bcf86cd799439082",
        "tournamentId": "507f1f77bcf86cd799439012",
        "title": "Counter-Strike 2 Winter Cup: Ice Wolves thống trị bảng xếp hạng",
        "content": "Giải đấu Counter-Strike 2 Winter Cup đang diễn ra sôi động với sự thống trị của đội Ice Wolves. Với 8 trận thắng và chỉ 2 trận thua, Ice Wolves đang dẫn đầu bảng xếp hạng với 1200 điểm. Đội trưởng Lê Văn Player đã chia sẻ: 'Chúng tôi đã chuẩn bị rất kỹ lưỡng cho giải đấu này và sẽ cố gắng duy trì phong độ tốt nhất.'",
        "images": [
            "https://images.unsplash.com/photo-1542751371-adc38448a05e?w=800&h=400&fit=crop"
        ],
        "authorId": "507f1f77bcf86cd799439022",
        "publishedAt": "2025-01-14T15:30:00Z",
        "status": "public"
    },
    {
        "_id": "507f1f77bcf86cd799439083",
        "tournamentId": "507f1f77bcf86cd799439013",
        "title": "Valorant Pro League: Team X bất ngờ đánh bại đối thủ mạnh",
        "content": "Trong một kết quả bất ngờ tại Valorant Pro League, Team X đã đánh bại đội được đánh giá cao hơn với tỷ số 2-1. Người chơi Ngô Thị Streamer đã có những pha clutch xuất sắc trong hiệp cuối cùng, giúp đội nhà giành chiến thắng quan trọng. Kết quả này đã làm thay đổi đáng kể bảng xếp hạng của giải đấu.",
        "images": [
            "https://images.unsplash.com/photo-1542751371-adc38448a05e?w=800&h=400&fit=crop"
        ],
        "authorId": "507f1f77bcf86cd799439025",
        "publishedAt": "2025-01-13T20:15:00Z",
        "status": "public"
    },
    {
        "_id": "507f1f77bcf86cd799439084",
        "tournamentId": "507f1f77bcf86cd799439014",
        "title": "Dota 2 International Qualifier: Dragon Warriors lọt vào top 4",
        "content": "Đội tuyển Dragon Warriors đã xuất sắc lọt vào top 4 của vòng loại Dota 2 International. Với 18 trận thắng và chỉ 1 trận thua, Dragon Warriors đang thể hiện sức mạnh vượt trội. Đội trưởng Vũ Thị Pro cho biết: 'Chúng tôi sẽ cố gắng hết sức để giành vé tham dự giải đấu quốc tế.'",
        "images": [
            "https://images.unsplash.com/photo-1542751371-adc38448a05e?w=800&h=400&fit=crop"
        ],
        "authorId": "507f1f77bcf86cd799439029",
        "publishedAt": "2025-01-12T14:45:00Z",
        "status": "public"
    },
    {
        "_id": "507f1f77bcf86cd799439085",
        "tournamentId": "507f1f77bcf86cd799439015",
        "title": "PUBG Mobile Championship: Fire Birds dẫn đầu sau tuần đầu tiên",
        "content": "Sau tuần đầu tiên của PUBG Mobile Championship, đội Fire Birds đã dẫn đầu bảng xếp hạng với 1600 điểm. Với 20 trận thắng và 5 trận thua, Fire Birds đang thể hiện sức mạnh vượt trội. Đội trưởng Lê Văn Player chia sẻ chiến thuật của đội: 'Chúng tôi tập trung vào việc positioning và teamwork.'",
        "images": [
            "https://images.unsplash.com/photo-1542751371-adc38448a05e?w=800&h=400&fit=crop"
        ],
        "authorId": "507f1f77bcf86cd799439021",
        "publishedAt": "2025-01-11T09:20:00Z",
        "status": "public"
    },
    {
        "_id": "507f1f77bcf86cd799439086",
        "tournamentId": "507f1f77bcf86cd799439016",
        "title": "FIFA 25 eSports Cup: Kỷ lục mới về số người tham gia",
        "content": "Giải đấu FIFA 25 eSports Cup đã thu hút kỷ lục 128 người tham gia, vượt qua kỳ vọng ban đầu. Giải đấu sẽ diễn ra từ ngày 1/7 đến 10/7/2025 tại Hà Nội với tổng giải thưởng 150 triệu VND. Ban tổ chức cho biết sẽ có nhiều hoạt động hấp dẫn bên lề giải đấu.",
        "images": [
            "https://images.unsplash.com/photo-1542751371-adc38448a05e?w=800&h=400&fit=crop"
        ],
        "authorId": "507f1f77bcf86cd799439022",
        "publishedAt": "2025-01-10T16:30:00Z",
        "status": "public"
    },
    {
        "_id": "507f1f77bcf86cd799439087",
        "tournamentId": "507f1f77bcf86cd799439017",
        "title": "Mobile Legends Pro League: Lịch thi đấu chính thức được công bố",
        "content": "Ban tổ chức Mobile Legends Pro League đã chính thức công bố lịch thi đấu chi tiết. Giải đấu sẽ bắt đầu từ ngày 1/9/2025 với 32 đội tham gia. Các trận đấu sẽ được phát sóng trực tiếp trên Twitch và YouTube. Đặc biệt, giải đấu sẽ có format loại kép, cho phép các đội có cơ hội thứ hai.",
        "images": [
            "https://images.unsplash.com/photo-1542751371-adc38448a05e?w=800&h=400&fit=crop"
        ],
        "authorId": "507f1f77bcf86cd799439025",
        "publishedAt": "2025-01-09T11:45:00Z",
        "status": "public"
    },
    {
        "_id": "507f1f77bcf86cd799439088",
        "tournamentId": "507f1f77bcf86cd799439018",
        "title": "Free Fire Vietnam Championship: Thông báo quan trọng về format thi đấu",
        "content": "Ban tổ chức Free Fire Vietnam Championship đã có thông báo quan trọng về việc thay đổi format thi đấu. Thay vì thi đấu tập trung, giải đấu sẽ được tổ chức online để đảm bảo an toàn cho tất cả người tham gia. Các đội sẽ thi đấu từ xa và được giám sát chặt chẽ để đảm bảo tính công bằng.",
        "images": [
            "https://images.unsplash.com/photo-1542751371-adc38448a05e?w=800&h=400&fit=crop"
        ],
        "authorId": "507f1f77bcf86cd799439029",
        "publishedAt": "2025-01-08T13:15:00Z",
        "status": "public"
    },
    {
        "_id": "507f1f77bcf86cd799439089",
        "tournamentId": "507f1f77bcf86cd799439011",
        "title": "Phỏng vấn đội trưởng Team Flash: 'Chúng tôi sẽ cố gắng bảo vệ ngôi vô địch'",
        "content": "Trong cuộc phỏng vấn độc quyền với đội trưởng Team Flash, Lê Văn Player đã chia sẻ về mục tiêu của đội trong năm 2025. 'Chúng tôi đã chuẩn bị rất kỹ lưỡng và sẽ cố gắng bảo vệ ngôi vô địch. Đội ngũ coaching staff đã phân tích rất kỹ các đối thủ và đưa ra chiến thuật phù hợp.'",
        "images": [
            "https://images.unsplash.com/photo-1542751371-adc38448a05e?w=800&h=400&fit=crop"
        ],
        "authorId": "507f1f77bcf86cd799439021",
        "publishedAt": "2025-01-07T08:30:00Z",
        "status": "public"
    },
    {
        "_id": "507f1f77bcf86cd799439090",
        "tournamentId": null,
        "title": "Cập nhật meta game mới nhất trong League of Legends",
        "content": "Với bản cập nhật mới nhất của League of Legends, meta game đã có những thay đổi đáng kể. Các champion như Yone, Yasuo và Zed đang trở nên mạnh mẽ hơn bao giờ hết. Các chuyên gia phân tích cho rằng đây sẽ là meta của những pha gank và teamfight nhanh chóng.",
        "images": [
            "https://images.unsplash.com/photo-1542751371-adc38448a05e?w=800&h=400&fit=crop"
        ],
        "authorId": "507f1f77bcf86cd799439021",
        "publishedAt": "2025-01-06T19:45:00Z",
        "status": "public"
    }
]